'''Dictionaries holding various alphabets organized by similar letters and degree of similarity.'''
from common import Similarity


GREEK = {
    # range:  U+0391 - U+03A9, U+03B1 - U+03C9
    # unused: ΔΛΠΦΨΩζθλνπςφψ
    Similarity.HIGH: {
        'A': ['Α'],
        'B': ['Β'],
        'C': ['Ϲ'],
        'E': ['Ε'],
        'H': ['Η'],
        'I': ['Ι'],
        'K': ['Κ'],
        'M': ['Μ'],
        'N': ['Ν'],
        'O': ['Ο'],
        'P': ['Ρ'],
        'T': ['Τ'],
        'X': ['Χ'],
        'Y': ['Υ'],
        'Z': ['Ζ'],
        'c': ['ϲ'],
        'o': ['ο'],
    },
    Similarity.MEDIUM: {
        'i': ['ι'],
        'k': ['κ'],
        'n': ['η'],
        'o': ['σ'],
        'p': ['ρ'],
        't': ['τ'],
        'u': ['υ'],
        'x': ['χ'],
        'y': ['γ'],
    },
    Similarity.LOW: {
        'E': ['Ξ', 'Σ'],
        'F': ['Γ'],
        'O': ['Θ'],
        'a': ['α'],
        'b': ['β'],
        'd': ['δ'],
        'e': ['ε'],
        'u': ['μ'],
        'w': ['ω'],
    }
}

CYRILLIC = {
    # range:  U+0400 - U+045F
    # unused: ЂЉЊЋЏДЖЙЛПФЦЧШЩЪЫЬЮгджйлпфцчщъыьюђѓљњџ
    Similarity.HIGH: {
        'A': ['А'],
        'B': ['В'],
        'C': ['С'],
        'E': ['Е'],
        'H': ['Н'],
        'I': ['І'],
        'J': ['Ј'],
        'K': ['К'],
        'M': ['М'],
        'O': ['О'],
        'P': ['Р'],
        'S': ['Ѕ'],
        'T': ['Т'],
        'X': ['Х'],
        'a': ['а'],
        'c': ['с'],
        'e': ['е'],
        'i': ['і'],
        'j': ['ј'],
        'o': ['о'],
        'p': ['р'],
        's': ['ѕ'],
        'x': ['х'],
        'y': ['у'],
    },
    Similarity.MEDIUM: {
        'E': ['Ѐ', 'Ё'],
        'I': ['Ї'],
        'K': ['Ќ'],
        'Y': ['У'],
        'b': ['в'],
        'e': ['ѐ', 'ё'],
        'h': ['н', 'ћ'],
        'i': ['ї'],
        'k': ['к', 'ќ'],
        'm': ['м'],
        't': ['т'],
    },
    Similarity.LOW: {
        'B': ['Б'],
        'E': ['З', 'Э', 'Є'],
        'F': ['Ѓ', 'Г'],
        'N': ['Ѝ', 'И'],
        'R': ['Я'],
        'Y': ['Ў'],
        'b': ['б'],
        'e': ['з', 'э', 'є'],
        'n': ['и', 'ѝ'],
        'r': ['я'],
        'w': ['ш'],
        'y': ['ў'],
    }
}
